pl-sql/8-3.tex
% Created 2023-12-03 dom 20:14
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\author{Agustín Alejandro Mota Hinojosa}
\date{\today}
\title{8 3}
\hypersetup{
 pdfauthor={Agustín Alejandro Mota Hinojosa},
 pdftitle={8 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Vocabulary}
\label{sec:orgf4d25d3}
\begin{enumerate}
\item \textbf{Function:} Returns a value to the caller.

\item \textbf{Input Parameter:} Provides values for a subprogram to process.

\item \textbf{Named Parameter Association:} Lists the actual parameters in arbitrary order and uses the association operator (`=>`, which is an equal and an arrow together) to associate a named formal parameter with its actual parameter.

\item \textbf{Mixed Parameter Association:} Lists some of the actual parameters as positional (no special operator) and some as named (with the `=>` operator).

\item \textbf{Positional Parameter Association:} Lists the actual parameters in the same order as the formal parameters.

\item \textbf{Input/Output Parameter:} Supplies an input value, which may be returned as a modified value.
\end{enumerate}
\section{Try}
\label{sec:orgeb420b9}
\begin{enumerate}
\item Modes for Parameters:
\begin{itemize}
\item IN Mode: Default mode. It passes values into the subprogram.
\item OUT Mode: It returns values from the subprogram.
\item IN OUT Mode: It both passes values into and returns values from the subprogram.
\end{itemize}
\item Procedures
\begin{enumerate}
\item code:
\begin{verbatim}
CREATE OR REPLACE PROCEDURE find_area_pop(
   p_country_id IN COUNTRIES.COUNTRY_ID%TYPE,
   p_country_name OUT COUNTRIES.COUNTRY_NAME%TYPE,
   p_population OUT COUNTRIES.POPULATION%TYPE,
   p_density OUT NUMBER
) AS
   v_area COUNTRIES.AREA%TYPE;
BEGIN
   SELECT COUNTRY_NAME, POPULATION, AREA
   INTO p_country_name, p_population, v_area
   FROM COUNTRIES
   WHERE COUNTRY_ID = p_country_id;

   p_density := p_population / v_area;
EXCEPTION
   WHEN NO_DATA_FOUND THEN
      DBMS_OUTPUT.PUT_LINE('Country ID ' || p_country_id || ' not found.');
END find_area_pop;
/
\end{verbatim}

\item Test:
\begin{verbatim}
DECLARE
   v_country_id NUMBER;
   v_country_name COUNTRIES.COUNTRY_NAME%TYPE;
   v_population COUNTRIES.POPULATION%TYPE;
   v_density NUMBER;
BEGIN
   v_country_id := 2; -- Canada
   find_area_pop(v_country_id, v_country_name, v_population, v_density);
   DBMS_OUTPUT.PUT_LINE('Country Name: ' || v_country_name);
   DBMS_OUTPUT.PUT_LINE('Population: ' || v_population);
   DBMS_OUTPUT.PUT_LINE('Density: ' || v_density);

   v_country_id := 10; -- Non-existent country
   find_area_pop(v_country_id, v_country_name, v_population, v_density);
END;
\end{verbatim}

\item modify:
\begin{verbatim}
CREATE OR REPLACE PROCEDURE find_area_pop(
   p_country_id IN COUNTRIES.COUNTRY_ID%TYPE,
   p_country_name OUT COUNTRIES.COUNTRY_NAME%TYPE,
   p_population OUT COUNTRIES.POPULATION%TYPE,
   p_density OUT NUMBER
) AS
   v_area COUNTRIES.AREA%TYPE;
BEGIN
   SELECT COUNTRY_NAME, POPULATION, AREA
   INTO p_country_name, p_population, v_area
   FROM COUNTRIES
   WHERE COUNTRY_ID = p_country_id;

   p_density := p_population / v_area;
EXCEPTION
   WHEN NO_DATA_FOUND THEN
      DBMS_OUTPUT.PUT_LINE('Country ID ' || p_country_id || ' not found.');
END find_area_pop;
/
\end{verbatim}

\item Test modified:
\begin{verbatim}
DECLARE
   v_country_id NUMBER;
   v_country_name COUNTRIES.COUNTRY_NAME%TYPE;
   v_population COUNTRIES.POPULATION%TYPE;
   v_density NUMBER;
BEGIN
   v_country_id := 2;
   find_area_pop(p_country_id => v_country_id,
                 p_country_name => v_country_name,
                 p_population => v_population,
                 p_density => v_density);
   DBMS_OUTPUT.PUT_LINE('Country Name: ' || v_country_name);
   DBMS_OUTPUT.PUT_LINE('Population: ' || v_population);
   DBMS_OUTPUT.PUT_LINE('Density: ' || v_density);
END;
\end{verbatim}
\end{enumerate}

\item Create Procedure for Squaring an Integer:
\begin{verbatim}
CREATE OR REPLACE PROCEDURE square_of_integer(
   p_number IN OUT NUMBER
) AS
BEGIN
   p_number := p_number * p_number;
END square_of_integer;
/
\end{verbatim}

\begin{enumerate}
\item Test
\begin{verbatim}
DECLARE
   v_number NUMBER := 4;
BEGIN
   square_of_integer(v_number);
   DBMS_OUTPUT.PUT_LINE('Square of 4: ' || v_number);

   v_number := 7;
   square_of_integer(v_number);
   DBMS_OUTPUT.PUT_LINE('Square of 7: ' || v_number);

   v_number := -20;
   square_of_integer(v_number);
   DBMS_OUTPUT.PUT_LINE('Square of -20: ' || v_number);
END;
\end{verbatim}
\end{enumerate}

\item Methods of Passing Parameters:
\begin{enumerate}
\item Retrieve Anonymous Block:
\begin{verbatim}
DECLARE
   v_country_id NUMBER := 2;
   v_country_name COUNTRIES.COUNTRY_NAME%TYPE;
   v_population COUNTRIES.POPULATION%TYPE;
   v_density NUMBER;
BEGIN
   find_area_pop(p_country_id, v_country_name, v_population, v_density);
   DBMS_OUTPUT.PUT_LINE('Country Name: ' || v_country_name);
   DBMS_OUTPUT.PUT_LINE('Population: ' || v_population);
   DBMS_OUTPUT.PUT_LINE('Density: ' || v_density);
END;
\end{verbatim}

\item Modify Anonymous Block:
\begin{verbatim}
plsql

DECLARE
   v_country_id NUMBER := 2;
   v_country_name COUNTRIES.COUNTRY_NAME%TYPE;
   v_population COUNTRIES.POPULATION%TYPE;
   v_density NUMBER;
BEGIN
   find_area_pop(v_country_name => v_country_name,
                 v_population => v_population,
                 v_density => v_density,
                 p_country_id => v_country_id);
   DBMS_OUTPUT.PUT_LINE('Country Name: ' || v_country_name);
   DBMS_OUTPUT.PUT_LINE('Population: ' || v_population);
   DBMS_OUTPUT.PUT_LINE('Density: ' || v_density);
END;
\end{verbatim}
\end{enumerate}
\end{enumerate}
\end{document}